In [144]:
import pandas as pd 
import numpy as np
from sqlalchemy import create_engine
import pymysql
from sklearn.preprocessing import OneHotEncoder
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

In [2]:
pip install pyarrow

Collecting pyarrow
  Using cached https://files.pythonhosted.org/packages/b5/84/ac0c239ffc4cde7c3aa9840ce734b42d4e9100e76927c6ed0100f00de10a/pyarrow-4.0.1-cp37-cp37m-win_amd64.whl
Requirement already satisfied: numpy>=1.16.6 in c:\users\nisha\anaconda3\lib\site-packages (from pyarrow) (1.20.3)
Installing collected packages: pyarrow
Successfully installed pyarrow-4.0.1
Note: you may need to restart the kernel to use updated packages.

In [8]:
leads= pd.read_parquet('ds_leads.parquet.gzip')
leads.head()

,lead_uuid,requested,loan_purpose,credit,annual_income
0,004cfd11-4d3f-4ba2-ad7d-0c0bb215e1f6,700.0,debt_consolidation,poor,24000.0
1,00aa9e4d-52c9-4240-864d-442646a422cc,1500.0,auto,poor,60000.0
2,00b02fa9-84cb-4219-abe8-29a35250a5d7,1000.0,other,good,60000.0
3,00e1153a-32e8-4cc3-9b3f-fe395ba855e2,1000.0,debt_consolidation,fair,36000.0
4,011f9ddb-398a-4488-b704-ba49743949ab,3000.0,debt_consolidation,fair,79200.0

In [18]:
leads.nunique()

lead_uuid        100000
requested           398
loan_purpose         28
credit                6
annual_income      2102
dtype: int64

In [9]:
offers= pd.read_parquet('ds_offers.parquet.gzip')
offers.head()

                               lead_uuid   offer_id     apr  lender_id
33  ae2d5046-a7c7-44fe-b6f4-cde3d8bf29e2  810117850  199.00       1103
35  b12fbb06-1402-4de3-a91f-fb6360ff85e4  810119030  249.00       1103
38  a119a3db-ab14-46fc-acd1-35cf20dec1ec  810122970  249.00       1103
40  3166d6bd-1c79-44c0-867c-889afd35990c  810124218   17.69        240
41  3166d6bd-1c79-44c0-867c-889afd35990c  810124220   17.19        240

In [19]:
offers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 458939 entries, 33 to 1065442
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   lead_uuid  458939 non-null  object
 1   offer_id   458939 non-null  int64
 2   apr        458922 non-null  float64
 3   lender_id  458939 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 17.5+ MB

In [10]:
clicks= pd.read_parquet('ds_clicks.parquet.gzip')
clicks.head()

    offer_id              clicked_at
0  810116813 2021-03-23 02:01:48.339
1  810118339 2021-03-23 02:01:14.135
2  810132429 2021-03-23 02:46:49.753
3  810152009 2021-03-23 04:46:19.662
4  810177207 2021-03-23 08:44:04.494

In [17]:
clicks.nunique()

offer_id      9320
clicked_at    9320
dtype: int64

## Writing to mysql db

In [24]:
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost:3306/{db}"
                       .format(user="root",
                               pw="aaryan007",
                               db="even"))

In [28]:
leads.to_sql(con=engine,name='leads',if_exists='append',index=False)

In [29]:
offers.to_sql(con=engine,name='offers',if_exists='append',index=False)

In [30]:
clicks.to_sql(con=engine,name='clicks',if_exists='append',index=False)

## Reading from mysql db

In [31]:
leads= pd.read_sql("select * from leads", engine.connect())
leads.head()

,lead_uuid,requested,loan_purpose,credit,annual_income
0,00006d50-80ca-49b8-83d2-579f7c5d8ec8,1000.0,debt_consolidation,fair,15000.0
1,0001d67d-4a2d-437c-a488-9e1599ae06ba,1000.0,other,good,72000.0
2,0003e3dd-554d-4f6a-a99a-86f1a74831e0,500.0,other,good,12000.0
3,0004bc3f-cb32-4465-a72c-3297a009b0bf,800.0,debt_consolidation,poor,36000.0
4,0004f7c4-5d48-4601-b5bd-875cce515ce2,1000.0,other,good,63000.0

In [32]:
offers= pd.read_sql("select * from offers", engine.connect())
offers.head()

                              lead_uuid   offer_id    apr lender_id
0  d9746df3-586f-4d57-8880-c7109b9f2940  810116701  159.0      1777
1  d9746df3-586f-4d57-8880-c7109b9f2940  810116702  159.0      1777
2  d9746df3-586f-4d57-8880-c7109b9f2940  810116703  159.0      1777
3  d9746df3-586f-4d57-8880-c7109b9f2940  810116704  159.0      1777
4  d9746df3-586f-4d57-8880-c7109b9f2940  810116705  159.0      1777

In [51]:
clicks= pd.read_sql("select * from clicks", engine.connect())
clicks.head()

NameError: name 'offer_id' is not defined

In [35]:
offers_leads= pd.merge(offers,leads,how='left',on='lead_uuid')
offers_leads.head()

,lead_uuid,offer_id,apr,lender_id,requested,loan_purpose,credit,annual_income
0,d9746df3-586f-4d57-8880-c7109b9f2940,810116701,159.0,1777,500.0,debt_consolidation,poor,24000.0
1,d9746df3-586f-4d57-8880-c7109b9f2940,810116702,159.0,1777,500.0,debt_consolidation,poor,24000.0
2,d9746df3-586f-4d57-8880-c7109b9f2940,810116703,159.0,1777,500.0,debt_consolidation,poor,24000.0
3,d9746df3-586f-4d57-8880-c7109b9f2940,810116704,159.0,1777,500.0,debt_consolidation,poor,24000.0
4,d9746df3-586f-4d57-8880-c7109b9f2940,810116705,159.0,1777,500.0,debt_consolidation,poor,24000.0

In [40]:
offers_leads.isnull().any(axis=1).sum()

578

In [45]:
offers_leads.dropna(inplace=True)

In [163]:
joined_df= pd.merge(offers_leads,clicks.rename(columns={'offer_id':'offer_id_2'}),how='left',left_on='offer_id',right_on='offer_id_2')
joined_df.head()

,lead_uuid,offer_id,apr,lender_id,requested,loan_purpose,credit,annual_income,clicked_at,offer_id_2
0,d9746df3-586f-4d57-8880-c7109b9f2940,810116701,159.0,1777,500.0,debt_consolidation,poor,24000.0,NaT,NaN
1,d9746df3-586f-4d57-8880-c7109b9f2940,810116702,159.0,1777,500.0,debt_consolidation,poor,24000.0,NaT,NaN
2,d9746df3-586f-4d57-8880-c7109b9f2940,810116703,159.0,1777,500.0,debt_consolidation,poor,24000.0,NaT,NaN
3,d9746df3-586f-4d57-8880-c7109b9f2940,810116704,159.0,1777,500.0,debt_consolidation,poor,24000.0,NaT,NaN
4,d9746df3-586f-4d57-8880-c7109b9f2940,810116705,159.0,1777,500.0,debt_consolidation,poor,24000.0,NaT,NaN

In [164]:
joined_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 458361 entries, 0 to 458360
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   lead_uuid      458361 non-null  object
 1   offer_id       458361 non-null  object
 2   apr            458361 non-null  float64
 3   lender_id      458361 non-null  object
 4   requested      458361 non-null  float64
 5   loan_purpose   458361 non-null  object
 6   credit         458361 non-null  object
 7   annual_income  458361 non-null  float64
 8   clicked_at     9311 non-null    datetime64[ns]
 9   offer_id_2     9311 non-null    object
dtypes: datetime64[ns](1), float64(3), object(6)
memory usage: 38.5+ MB

In [165]:
joined_df['nocredit']=joined_df['credit'].apply(lambda c: 1 if c in ("limited",'unknown') else 0)

In [166]:
joined_df['credit'].value_counts()

poor         170609
good         129672
fair         109990
excellent     47743
limited         300
unknown          47
Name: credit, dtype: int64

In [167]:
joined_df['credit_bucket']= joined_df['credit'].map({'limited':0,'unknown':0,'poor':1,'good':2,'fair':3,'excellent':4})
joined_df['credit_bucket'].value_counts()

1    170609
2    129672
3    109990
4     47743
0       347
Name: credit_bucket, dtype: int64

In [168]:
joined_df['loan_purpose'].value_counts()

debt_consolidation    319317
other                  51077
credit_card_refi       28292
home_improvement       21436
large_purchases         9637
auto                    6496
medical_dental          6054
business                3176
moving_relocation       3017
special_occasion        1789
baby                    1268
boat                    1200
vacation                1083
household_expenses      1023
taxes                    977
wedding                  741
auto_refinance           617
student_loan             615
auto_purchase            165
unknown                   92
green                     72
emergency                 68
life_event                53
car_repair                44
cosmetic                  31
student_loan_refi         12
home_purchase              8
motorcycle                 1
Name: loan_purpose, dtype: int64

In [169]:
enc=OneHotEncoder()
enc.fit_transform(joined_df[['loan_purpose']])

import pickle
with open("encoder", "wb") as f: 
    pickle.dump(enc, f)

In [130]:
with open("encoder", "rb") as f:
    encoder = pickle.load(f) 
pd.DataFrame(encoder.transform([['moving_relocation']]).toarray())

,0,1,2,3,4,5,6,7,8,9,...,18,19,20,21,22,23,24,25,26,27
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [170]:
joined_df=pd.concat([joined_df,pd.DataFrame(enc.fit_transform(joined_df[['loan_purpose']]).toarray())], axis=1)

In [171]:
joined_df['output']= joined_df['offer_id_2'].fillna(0).apply(lambda k: k if k==0 else 1)
joined_df['output'].head()

0    0
1    0
2    0
3    0
4    0
Name: output, dtype: int64

In [172]:
joined_df.drop(columns=['lead_uuid','offer_id','lender_id','clicked_at','offer_id_2','loan_purpose','credit'],inplace=True)

In [173]:
joined_df.head()

,apr,requested,annual_income,nocredit,credit_bucket,0,1,2,3,4,...,19,20,21,22,23,24,25,26,27,output
0,159.0,500.0,24000.0,0,1,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0
1,159.0,500.0,24000.0,0,1,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0
2,159.0,500.0,24000.0,0,1,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0
3,159.0,500.0,24000.0,0,1,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0
4,159.0,500.0,24000.0,0,1,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0

In [174]:
joined_df.isnull().any(axis=1).sum()

0

In [175]:
joined_df['output'].value_counts()

0    449050
1      9311
Name: output, dtype: int64

In [176]:
X=joined_df.drop(columns=['output'])
y=joined_df['output']

In [180]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=42,stratify=y)

In [181]:
clf = LogisticRegression(random_state=0).fit(X_train, y_train)
clf.score(X_train, y_train)

0.9796857273758618

In [182]:
clf.score(X_test,y_test)

0.9796886760551089

In [183]:
with open("train_model","wb") as f:
    pickle.dump(clf,f)